export const genders = [
  'זכר',
  'נקבה',
];

export const sectors = [
  'חרדי/ת',
  'חסידי/ת',
  'ליטאי/ת',
  'דתי/ה לאומי/ת',
  'חרדלי/ת',
  'מסורתי/ת',
  'חילוני/ת',
  'אחר/ת',
];

export const sectorLabels: Record<string, string> = {
  HAREDI: 'חרדי/ת',
  HAREDI_CHASIDUT: 'חסידי/ת',
  HAREDI_LITVAK: 'ליטאי/ת',
  DATI_LEUMI: 'דתי/ה לאומי/ת',
  DATI_LEUMI_HARDAL: 'חרדלי/ת',
  MASORTI: 'מסורתי/ת',
  HILONI: 'חילוני/ת',
  OTHER: 'אחר/ת',
};

export const marriageStatuses = [
  'רווק/ה',
  'גרוש/ה',
  'אלמן/ה',
];

export const ethnicities = [
  'אשכנזי/ה',
  'עדות המזרח',
  'תימני/ת',
  'מעורב/ת',
  'אחר/ת',
];

export const interests = [
  'תורה',
  'ספורט',
  'מוסיקה',
  'אמנות',
  'טכנולוגיה',
  'נסיעות',
  'בישול',
  'התנדבות',
  'קריאה',
  'שחמט',
  'גינון',
  'צילום',
  'כתיבה',
  'קולנוע',
  'תיאטרון',
  'ריקוד',
  'יוגה',
  'מדיטציה',
  'ריצה',
  'אופניים',
  'טיולים',
  'שחיה',
  'ציור',
  'תרבות קפה',
  'טעימות יין',
  'בישול בירה',
  'גיימינג',
  'משחקי קופסה',
  'פילוסופיה',
  'פוליטיקה',
  'טבע',
  'מדע',
  'היסטוריה',
  'אופנה',
  'דיג',
  'טיפוס הרים',
  'אסטרונומיה',
  'שירה',
];

export const proposePreferences = [
  'מעוניין/ת שיציעו לי קודם',
  'מעוניין/ת שיציעו קודם לצד השני',
  'ללא העדפה',
];
